Revit 2024 API
ParameterTypeId.StairsTriserTreadNumber Property
 "Tread Number": Count the sequential number of tread in the stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsTriserTreadNumber { get; }
Visual Basic
Public Shared ReadOnly Property StairsTriserTreadNumber As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsTriserTreadNumber {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace